{
  "bos_token": "<s>",
  "eos_token": "</s>",
  "pad_token": "<pad>",
  "unk_token": "<unk>",
  "tokenizer_class": "SentencePieceTokenizer",
  "model_file": "tokenizer.model",
  "vocab_file": "tokenizer.vocab",
  "auto_map": {
    "AutoTokenizer": [
      null,
      "tokenizer.SentencePieceTokenizer"
    ]
  }
}